-- ████╗   ██╗   ██████╗   ██████╗  ██████╗ ██╗  ██╗ ██████╗ ██╗     █████╗  ██████╗  ██████╗ ██████╗    ██╗ --
-- ██╔██╗  ██║ ██╔═════╝   ██╔══██╗ ██╔═══╝ ██║  ██║ ██╔═══╝ ██║    ██╔══██╗ ██╔══██╗ ██╔═══╝ ██╔══██╗   ██║ --
-- ██║╚██╗ ██║ ██║         ██║  ██║ █████╗  ██║  ██║ █████╗  ██║    ██║  ██║ ██████╔╝ █████╗  ██████╔╝   ██║ --
-- ██║ ╚██╗██║ ██║         ██║  ██║ ██╔══╝  ╚██╗██╔╝ ██╔══╝  ██║    ██║  ██║ ██╔═══╝  ██╔══╝  ██╔══██╗   ╚═╝ --
-- ██║  ╚████║ ╚═██████╗   ██████╔╝ ██████╗  ╚███╔╝  ██████╗ ██████╗╚█████╔╝ ██║      ██████╗ ██║  ██║   ██╗ --
-- ╚═╝   ╚═══╝   ╚═════╝   ╚═════╝  ╚═════╝   ╚══╝   ╚═════╝ ╚═════╝ ╚════╝  ╚═╝      ╚═════╝ ╚═╝  ╚═╝   ╚═╝ --

-- เปิดใช้งานระบบรายละเอียดสิ่งของ
Config.EnableItemDescriptions = true

-- ชื่อหมวดหมู่สิ่งของต่างๆที่ไม่ได้อยู่ใน Filter (หากไม่ได้ตั้งค่า จะมีค่าเป็น "ทั่วไป")
Config.ItemCategoryDefaultIfNotInFilters = {
	-- item = 'สิ่งของ',
	account = 'การเงิน',
	key = 'กุญแจ',
	accessory = 'เครื่องแต่งกาย',
	weapon = 'อาวุธ',

	personal = 'ส่วนตัว'
}

-- Custom หมวดหมู่ของสิ่งของตามชนิด (เพิ่ม)
Config.CustomItemCategories = {
	item = {
		['apple'] = { 'งานขาว' },
		['cement'] = { 'งานดำ' },
		['cable'] = { 'งานดำ' },
	},
	account = {
		['black_money'] = { '' }
	},
	key = {

	},
	weapon = {
		['WEAPON_BAT'] = { 'Tier 1' },
		['WEAPON_POOLCUE'] = { 'Tier 1' },
		['WEAPON_GOLFCLUB'] = { 'Tier 1' },
	},
	accessory = {

	}
}

-- รายละเอียดเริ่มต้นของสิ่งของชนิดต่างๆ
Config.DefaultItemDescriptions = {
	item = 'สิ่งของทั่วไปในประเทศ บางอย่างอาจจะมีค่ามากหรือค่าน้อย อยู่ที่คุณพิจารณา',
	account = 'Test TEST<banner>Hello World</banner><banner>Hello World</banner>Test<banner>Hello World</banner>',
	key = '',
	vehicle_key = '',
	house_key = '',
	accessory = '',
	weapon = 'อุปกรณ์นี้ สามารถใช้ทำร้ายผู้เล่นได้ ดังนั้น ห้ามใช้งานมั่ว หากผิดกฎ มีใบเหลืองแน่นอน',

	personal = '',
}

-- รายละเอียดของสิ่งของต่างๆ
Config.ItemDescriptions = {
	item = {
		['bread'] = 'ส่วนประกอบอาหารที่ใช้ในการคราฟ <rarity-0>ขนมปัง</rarity-0>\nอีกทั้งยังสามารถกินเพื่อเพิ่มหลอดอาหารจำนวนหนึ่ง\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งานเก็บพุดดิ้ง',
		['water'] = 'สิ่งของงานขาว/งานถูกกฎหมาย สามารถขายที่ตลาด Economy เพื่อได้รับ <rarity-0>เงิน</rarity-0> ตามมูลค่าตลาดจังหวะนั้นๆ (กด <btn>=</btn> เพื่อดูราคาตลาด)\nอีกทั้งยังสามารถกินเพื่อเพิ่มหลอดอาหารได้เล็กน้อยมากๆ\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งานเก็บมังคุด',
		['cable'] = 'อุปกรณ์ที่ใช้เป็นส่วนผสมสำหรับการคราฟอาวุธและของแกงค์\n* สามารถโดนข้อหาจากตำรวจได้ หากมีครอบครองไว้ในตัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- งัดตู้ไฟฟ้า',
		['cement'] = 'อุปกรณ์ที่ใช้เป็นส่วนผสมสำหรับการคราฟอาวุธและของแกงค์\n* สามารถโดนข้อหาจากตำรวจได้ หากมีครอบครองไว้ในตัว\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- ขโมยกองปูน',
		['dragon_red'] = 'แฟชั่นสุดคูล มังการแดงมีไฟที่หาง ที่ใครเดินผ่านก็ต้องเหลียวหลังมามองหางมังกร แต่ไม่ได้มองหน้าคุณ!\n\n<highlight>[แหล่งที่ได้รับ]</highlight>\n- โต๊ะคราฟลับ\n- กาชาโดเนท'
	},
	account = {
		['money'] = 'หน่วยเงินที่ใช้ภายในประเทศ สามารถใช้จ่ายกับการซื้อสินค้า, สิ่งของอำนวยความสะดวก, ยานพาหนะ, และการบริการอื่นๆ',
		['bank'] = '',
		['black_money'] = 'หน่วยเงินผิดภฎหมาย ใช้เป็นค่าใช้จ่ายในการคราฟอาวุธและของแกงค์\n* สามารถโดนข้อหาจากตำรวจได้ หากมีครอบครองไว้ในตัว'
	},
	key = {
		['vehicle_key'] = 'กุญแจสำหรับยานพาหนะส่วนตัว ใช้เพื่อล็อคและปลดล็อครถ\n* หากต้องการโอนสิทธิยานพาหนะ จะต้องใช้ <rarity-0>บัตรโอนรถ</rarity-0> เพื่อดำเนินการ',
		['house_key'] = ''
	},
	weapon = {
		['WEAPON_BAT'] = '',
		['WEAPON_POOLCUE'] = '',
		['WEAPON_GOLFCLUB'] = '',
		['WEAPON_MACHETE'] = '',
		['WEAPON_BOTTLE'] = '',
	},
	accessory = {
		['player_bags'] = '',
		['player_bracelet'] = '',
		['player_clothes'] = '',
		['player_ears'] = '',
		['player_glasses'] = '',
		['player_helmet'] = '',
		['player_mask'] = '',
		['player_pants'] = '',
		['player_shoes'] = '',
		['player_watch'] = '',
	},

	personal = {
		['id_card'] = 'ใช้งานเพื่อแสดงบัตรประชาชนให้กับผู้เล่นใกล้เคียง (ผู้เล่นอื่นจะเห็นชื่อและอาชีพของคุณ)',
	},
}